tobliao/Microchip-Projects-MASTER-2025/CAN/src/packs/PIC32CM3204GV00048_DFP/component/pm.h
/* -------- PM_APBASEL : (PM Offset: 0x09) (R/W 8) APBA Clock Select -------- */
#define PM_APBASEL_RESETVALUE                 _UINT8_(0x00)                                        /*  (PM_APBASEL) APBA Clock Select  Reset Value */

#define PM_APBASEL_APBADIV_Pos                _UINT8_(0)                                           /* (PM_APBASEL) APBA Prescaler Selection Position */
#define PM_APBASEL_APBADIV_Msk                (_UINT8_(0x7) << PM_APBASEL_APBADIV_Pos)             /* (PM_APBASEL) APBA Prescaler Selection Mask */
#define PM_APBASEL_APBADIV(value)             (PM_APBASEL_APBADIV_Msk & (_UINT8_(value) << PM_APBASEL_APBADIV_Pos)) /* Assignment of value for APBADIV in the PM_APBASEL register */
#define   PM_APBASEL_APBADIV_DIV1_Val         _UINT8_(0x0)                                         /* (PM_APBASEL) Divide by 1  */
#define   PM_APBASEL_APBADIV_DIV2_Val         _UINT8_(0x1)                                         /* (PM_APBASEL) Divide by 2  */
#define   PM_APBASEL_APBADIV_DIV4_Val         _UINT8_(0x2)                                         /* (PM_APBASEL) Divide by 4  */
#define   PM_APBASEL_APBADIV_DIV8_Val         _UINT8_(0x3)                                         /* (PM_APBASEL) Divide by 8  */
#define   PM_APBASEL_APBADIV_DIV16_Val        _UINT8_(0x4)                                         /* (PM_APBASEL) Divide by 16  */
#define   PM_APBASEL_APBADIV_DIV32_Val        _UINT8_(0x5)                                         /* (PM_APBASEL) Divide by 32  */
#define   PM_APBASEL_APBADIV_DIV64_Val        _UINT8_(0x6)                                         /* (PM_APBASEL) Divide by 64  */
#define   PM_APBASEL_APBADIV_DIV128_Val       _UINT8_(0x7)                                         /* (PM_APBASEL) Divide by 128  */
#define PM_APBASEL_APBADIV_DIV1               (PM_APBASEL_APBADIV_DIV1_Val << PM_APBASEL_APBADIV_Pos) /* (PM_APBASEL) Divide by 1 Position */
#define PM_APBASEL_APBADIV_DIV2               (PM_APBASEL_APBADIV_DIV2_Val << PM_APBASEL_APBADIV_Pos) /* (PM_APBASEL) Divide by 2 Position */
#define PM_APBASEL_APBADIV_DIV4               (PM_APBASEL_APBADIV_DIV4_Val << PM_APBASEL_APBADIV_Pos) /* (PM_APBASEL) Divide by 4 Position */
#define PM_APBASEL_APBADIV_DIV8               (PM_APBASEL_APBADIV_DIV8_Val << PM_APBASEL_APBADIV_Pos) /* (PM_APBASEL) Divide by 8 Position */
#define PM_APBASEL_APBADIV_DIV16              (PM_APBASEL_APBADIV_DIV16_Val << PM_APBASEL_APBADIV_Pos) /* (PM_APBASEL) Divide by 16 Position */
#define PM_APBASEL_APBADIV_DIV32              (PM_APBASEL_APBADIV_DIV32_Val << PM_APBASEL_APBADIV_Pos) /* (PM_APBASEL) Divide by 32 Position */
#define PM_APBASEL_APBADIV_DIV64              (PM_APBASEL_APBADIV_DIV64_Val << PM_APBASEL_APBADIV_Pos) /* (PM_APBASEL) Divide by 64 Position */
#define PM_APBASEL_APBADIV_DIV128             (PM_APBASEL_APBADIV_DIV128_Val << PM_APBASEL_APBADIV_Pos) /* (PM_APBASEL) Divide by 128 Position */
#define PM_APBASEL_Msk                        _UINT8_(0x07)                                        /* (PM_APBASEL) Register Mask  */


/* -------- PM_APBBSEL : (PM Offset: 0x0A) (R/W 8) APBB Clock Select -------- */
#define PM_APBBSEL_RESETVALUE                 _UINT8_(0x00)                                        /*  (PM_APBBSEL) APBB Clock Select  Reset Value */

#define PM_APBBSEL_APBBDIV_Pos                _UINT8_(0)                                           /* (PM_APBBSEL) APBB Prescaler Selection Position */
#define PM_APBBSEL_APBBDIV_Msk                (_UINT8_(0x7) << PM_APBBSEL_APBBDIV_Pos)             /* (PM_APBBSEL) APBB Prescaler Selection Mask */
#define PM_APBBSEL_APBBDIV(value)             (PM_APBBSEL_APBBDIV_Msk & (_UINT8_(value) << PM_APBBSEL_APBBDIV_Pos)) /* Assignment of value for APBBDIV in the PM_APBBSEL register */
#define   PM_APBBSEL_APBBDIV_DIV1_Val         _UINT8_(0x0)                                         /* (PM_APBBSEL) Divide by 1  */
#define   PM_APBBSEL_APBBDIV_DIV2_Val         _UINT8_(0x1)                                         /* (PM_APBBSEL) Divide by 2  */
#define   PM_APBBSEL_APBBDIV_DIV4_Val         _UINT8_(0x2)                                         /* (PM_APBBSEL) Divide by 4  */
#define   PM_APBBSEL_APBBDIV_DIV8_Val         _UINT8_(0x3)                                         /* (PM_APBBSEL) Divide by 8  */
#define   PM_APBBSEL_APBBDIV_DIV16_Val        _UINT8_(0x4)                                         /* (PM_APBBSEL) Divide by 16  */
#define   PM_APBBSEL_APBBDIV_DIV32_Val        _UINT8_(0x5)                                         /* (PM_APBBSEL) Divide by 32  */
#define   PM_APBBSEL_APBBDIV_DIV64_Val        _UINT8_(0x6)                                         /* (PM_APBBSEL) Divide by 64  */
#define   PM_APBBSEL_APBBDIV_DIV128_Val       _UINT8_(0x7)                                         /* (PM_APBBSEL) Divide by 128  */
#define PM_APBBSEL_APBBDIV_DIV1               (PM_APBBSEL_APBBDIV_DIV1_Val << PM_APBBSEL_APBBDIV_Pos) /* (PM_APBBSEL) Divide by 1 Position */
#define PM_APBBSEL_APBBDIV_DIV2               (PM_APBBSEL_APBBDIV_DIV2_Val << PM_APBBSEL_APBBDIV_Pos) /* (PM_APBBSEL) Divide by 2 Position */
#define PM_APBBSEL_APBBDIV_DIV4               (PM_APBBSEL_APBBDIV_DIV4_Val << PM_APBBSEL_APBBDIV_Pos) /* (PM_APBBSEL) Divide by 4 Position */
#define PM_APBBSEL_APBBDIV_DIV8               (PM_APBBSEL_APBBDIV_DIV8_Val << PM_APBBSEL_APBBDIV_Pos) /* (PM_APBBSEL) Divide by 8 Position */
#define PM_APBBSEL_APBBDIV_DIV16              (PM_APBBSEL_APBBDIV_DIV16_Val << PM_APBBSEL_APBBDIV_Pos) /* (PM_APBBSEL) Divide by 16 Position */
#define PM_APBBSEL_APBBDIV_DIV32              (PM_APBBSEL_APBBDIV_DIV32_Val << PM_APBBSEL_APBBDIV_Pos) /* (PM_APBBSEL) Divide by 32 Position */
#define PM_APBBSEL_APBBDIV_DIV64              (PM_APBBSEL_APBBDIV_DIV64_Val << PM_APBBSEL_APBBDIV_Pos) /* (PM_APBBSEL) Divide by 64 Position */
#define PM_APBBSEL_APBBDIV_DIV128             (PM_APBBSEL_APBBDIV_DIV128_Val << PM_APBBSEL_APBBDIV_Pos) /* (PM_APBBSEL) Divide by 128 Position */
#define PM_APBBSEL_Msk                        _UINT8_(0x07)                                        /* (PM_APBBSEL) Register Mask  */


